In [4]:
import json
import pandas as pd

# Read the content of the JSON file
with open("data.json", "r") as file:
    json_data = json.load(file)

# Convert JSON data to a DataFrame
df = pd.json_normalize(json_data['employees'])

# Print the DataFrame
df

,id,name,age,email,departments,address.street,address.city,address.zipcode
0,1,John Doe,30,john@example.com,"[HR, Finance]",123 Main Street,New York,10001
1,2,Alice Smith,28,alice@example.com,"[Engineering, Product]",456 Park Avenue,Los Angeles,90001

In [5]:
# Convert JSON data to a DataFrame
df = pd.json_normalize(json_data['company'])

# Print the DataFrame
df

       name       location  founded_year         ceo.name  ceo.age
0  XYZ Corp  United States          2005  Michael Johnson       45